In [1]:
import os

import pandas as pd

from pydataset import data

import env

import seaborn as sns

import acquire

**# 4 Use a python module (pydata or seaborn datasets) containing datasets as a source from the iris data. Create a pandas dataframe, df_iris, from this data.**

    print the first 3 rows
    print the number of rows and columns (shape)
    print the column names
    print the data type of each column
    print the summary statistics for each of the numeric variables

In [ ]:
df_iris_sns = sns.load_dataset('iris')

In [ ]:
iris_df = data('iris')

iris_df.info()

In [ ]:
iris_df.head(3)

In [ ]:
df_iris_sns.head(3)

In [ ]:
iris_df.shape

In [ ]:
iris_df.columns

In [ ]:
iris_df.columns.to_list()

# prints only column names

In [ ]:
iris_df.dtypes

In [ ]:
iris_df.describe().T

## SCROLL DOWN FOR Nº 5

**# 6 Download the previous exercise's file into an excel (File → Download → Microsoft Excel).**  
**Read the downloaded file into a dataframe named df_excel.**

    assign the first 100 rows to a new dataframe, df_excel_sample
    print the number of rows of your original dataframe
    print the first 5 column names
    print the column names that have a data type of 'object'
    compute the range for each of the numeric variables.

In [ ]:
df_excel = pd.read_excel('train.xlsx', sheet_name = 'train')

# similar : df_excel = pd.read_excel('train.xlsx')

In [ ]:
df_excel_sample = df_excel.head(100)

# assigns the first 100 rows to a new dataframe, df_excel_sample

In [ ]:
df_excel_sample.shape

In [ ]:
df_excel.shape[0]

# prints the number of rows of your original dataframe

In [ ]:
len(df_excel.index)

# prints the number of rows of your original dataframe

In [ ]:

print(df_excel.columns[5:])

# gives the columns starting at index 5 to the end.

In [ ]:
# prints the names of the first 5 columns
print(df_excel.columns[:5])

# prints the 1st index, aka, the number of columns
print(df_excel.shape[1])

df_excel.iloc[: , :5]

# prints the first 5 column names

# alternate way to print the first 5 columns : 
    # df_excel[df_excel.columns[:5]]

In [ ]:
df_excel.dtypes

In [ ]:
print(df_excel.select_dtypes(include = ['object']).columns)

print(list(df_excel.select_dtypes(include=['object']).columns))

# prints the column names that have a data type of 'object'

In [ ]:
# find the columns with numeric variables
# excludes the objects

print(df_excel.select_dtypes(exclude = ['object']).columns)

In [ ]:
#  compute the range for each of the numeric variables :
# find the columns with numeric variables

(list(df_excel.select_dtypes(include=['int64', 'float64']).columns))

In [ ]:
# df_excel.sort_values

# df_excel['PassengerId'](df_excel.max() - df_excel.min()).idxmax()

pIDrange = df_excel['PassengerId'].max() - df_excel['PassengerId'].min()
pIDrange

#  computes the range for each of the numeric variables.

In [ ]:
survivedrange = df_excel['Survived'].max() - df_excel['Survived'].min()
survivedrange

In [ ]:
survivedrangecombo = df_excel[['Survived', 'Pclass']].max() - df_excel[['Survived', 'Pclass']].min()
survivedrangecombo

In [ ]:
titanic_stats = df_excel[['Age', 'Fare']].describe()
titanic_stats

In [ ]:
titanic_stats['range'] = titanic_stats['max'] - titanic_stats['min']
titanic_stats['range']

In [ ]:
passclass = df_excel['Pclass'].max() - df_excel['Pclass'].min()
passclass

In [ ]:
p_age = df_excel['Age'].max() - df_excel['Age'].min()
p_age

In [ ]:
SibSprange = df_excel['SibSp'].max() - df_excel['SibSp'].min()
SibSprange

In [ ]:
Parch_range = df_excel['Parch'].max() - df_excel['Parch'].min()
Parch_range

In [ ]:
Fare_range = df_excel['Fare'].max() - df_excel['Fare'].min()
Fare_range

**# 5 Read the data from this google sheet into a dataframe, df_google.**

    print the first 3 rows
    print the number of rows and columns
    print the column names
    print the data type of each column
    print the summary statistics for each of the numeric variables
    print the unique values for each of your categorical variables

In [ ]:

# grab the google sheet
sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'    

csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

# this code in is applied to all url replacements



df_googlesheet = pd.read_csv(csv_export_url)

In [ ]:
df_googlesheet.head(3)

In [ ]:
df_googlesheet.shape

In [ ]:
df_googlesheet.columns

In [ ]:
df_googlesheet.dtypes

In [ ]:
df_googlesheet.describe()

In [ ]:
df_googlesheet.nunique()

In [ ]:
df_googlesheet.Survived.value_counts(dropna = False)

In [ ]:
df_googlesheet.Sex.value_counts(dropna = False)

In [ ]:
df_googlesheet.Embarked.value_counts(dropna = False)

##  Data Preparation Exercises

**Nº1 / Using the Iris Data :**

    Use the function defined in acquire.py to load the iris data.

    Drop the species_id and measurement_id columns.

    Rename the species_name column to just species.

    Create dummy variables of the species name and concatenate onto the iris dataframe. (This is for practice, we don't always have to encode the target, but if we used species as a feature, we would need to encode it).

    Create a function named prep_iris that accepts the untransformed iris data, and returns the data with the transformations above applied.

In [2]:
iris_data = acquire.get_iris_data(env.sql_connexion)

In [3]:
iris_data.shape

(150, 7)

In [4]:
# Drop the species_id and measurement_id columns.

iris_data.columns.to_list()

['species_id',
 'species_name',
 'measurement_id',
 'sepal_length',
 'sepal_width',
 'petal_length',
 'petal_width']

In [5]:
# Drop the species_id and measurement_id columns.

i_drop = ['species_id', 'measurement_id']

iris_data.drop(columns = i_drop, inplace = True)

In [7]:
iris_data.head()

  species_name  sepal_length  sepal_width  petal_length  petal_width
0       setosa           5.1          3.5           1.4          0.2
1       setosa           4.9          3.0           1.4          0.2
2       setosa           4.7          3.2           1.3          0.2
3       setosa           4.6          3.1           1.5          0.2
4       setosa           5.0          3.6           1.4          0.2

In [9]:
#     Rename the species_name column to just species.


iris_data = iris_data.rename(columns={"species_name": "species"})

In [11]:
#  Create dummy variables of the species name and concatenate onto the iris dataframe. 
# (This is for practice, we don't always have to encode the target, but if we used 
# species as a feature, we would need to encode it).

dummy_iris = pd.get_dummies(iris_data[['species']])

dummy_iris.head()

   species_setosa  species_versicolor  species_virginica
0               1                   0                  0
1               1                   0                  0
2               1                   0                  0
3               1                   0                  0
4               1                   0                  0

In [15]:
drop_1st_iris = pd.get_dummies(iris_data[['species']],  drop_first = True)

# concatenate onto the iris dataframe. 

concat_dummy_iris = pd.concat([iris_data, dummy_iris], axis = 1)

# attaches the tables row-wise, a 0-axis concatenation


concat_dummy_iris.head()

,species,sepal_length,sepal_width,petal_length,petal_width,species_setosa,species_versicolor,species_virginica
0,setosa,5.1,3.5,1.4,0.2,1,0,0
1,setosa,4.9,3.0,1.4,0.2,1,0,0
2,setosa,4.7,3.2,1.3,0.2,1,0,0
3,setosa,4.6,3.1,1.5,0.2,1,0,0
4,setosa,5.0,3.6,1.4,0.2,1,0,0

In [21]:
##    Create a function named prep_iris that accepts the untransformed iris data, 
##    and returns the data with the transformations above applied.

def prep_iris(unto):
    
    i_drop = ['species_id', 'measurement_id']

    iris_data.drop(columns = i_drop, inplace = True)

    dummy_iris = pd.get_dummies(iris_data[['species']])
    
    concat_dummy_iris = pd.concat([iris_data, dummy_iris], axis = 1)
    
    return unto

In [44]:
test_iris_df = acquire.get_iris_data(env.sql_connexion)

test_iris_df.head()

,species_id,species_name,measurement_id,sepal_length,sepal_width,petal_length,petal_width
0,1,setosa,1,5.1,3.5,1.4,0.2
1,1,setosa,2,4.9,3.0,1.4,0.2
2,1,setosa,3,4.7,3.2,1.3,0.2
3,1,setosa,4,4.6,3.1,1.5,0.2
4,1,setosa,5,5.0,3.6,1.4,0.2

In [45]:
tidied_iris = prep_iris(test_iris_df)

tidied_iris

KeyError: "['species_id', 'measurement_id'] not found in axis"

**Nº2 / Using the Titanic dataset :**

    Use the function defined in acquire.py to load the Titanic data.

    Drop any unnecessary, unhelpful, or duplicated columns.

    Encode the categorical columns. Create dummy variables of the categorical columns and concatenate them onto the dataframe.

    Create a function named prep_titanic that accepts the raw titanic data, and returns the data with the transformations above applied.

In [33]:
titanic_data = acquire.get_titanic_data(env.sql_connexion)

titanic_data.head()

,Unnamed: 0,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1

In [34]:
# Drop any unnecessary, unhelpful, or duplicated columns.

t_drop = ['passenger_id', 'embarked', 'deck', 'age']

titanic_data.drop(columns = t_drop, inplace = True)

In [35]:
# Encode the categorical columns. Create dummy variables of the categorical 
# columns and concatenate them onto the dataframe.

titanic_data.isna().sum()

Unnamed: 0     0
survived       0
pclass         0
sex            0
sibsp          0
parch          0
fare           0
class          0
embark_town    2
alone          0
dtype: int64

In [39]:
# Create dummy variables of the categorical columns

t_dummy = pd.get_dummies(titanic_data[['survived','sex', 'embark_town', 'alone', 'class']], drop_first = True)
t_dummy.head()

,survived,alone,sex_male,embark_town_Queenstown,embark_town_Southampton,class_Second,class_Third
0,0,0,1,0,1,0,1
1,1,0,0,0,0,0,0
2,1,1,0,0,1,0,1
3,1,0,0,0,1,0,0
4,0,1,1,0,1,0,1

In [ ]:
# concatenate them onto the dataframe

In [42]:
t_concat = pd.concat([titanic_data, t_dummy], axis = 1)
t_concat.head()

,Unnamed: 0,survived,pclass,sex,sibsp,parch,fare,class,embark_town,alone,survived,alone,sex_male,embark_town_Queenstown,embark_town_Southampton,class_Second,class_Third
0,0,0,3,male,1,0,7.2500,Third,Southampton,0,0,0,1,0,1,0,1
1,1,1,1,female,1,0,71.2833,First,Cherbourg,0,1,0,0,0,0,0,0
2,2,1,3,female,0,0,7.9250,Third,Southampton,1,1,1,0,0,1,0,1
3,3,1,1,female,1,0,53.1000,First,Southampton,0,1,0,0,0,1,0,0
4,4,0,3,male,0,0,8.0500,Third,Southampton,1,0,1,1,0,1,0,1

In [58]:
## Create a function named prep_titanic that accepts the raw 
# titanic data, and returns the data with the transformations above applied.

def prep_titanic(surv):
    t_drop = ['passenger_id', 'embarked', 'deck', 'age']

    titanic_data.drop(columns = t_drop, inplace = True)
    
    t_dummy = pd.get_dummies(titanic_data[['survived','sex', 'embark_town', 'alone', 'class']], drop_first = True)

    t_concat = pd.concat([titanic_data, t_dummy], axis = 1)
    
    return surv

In [ ]:

def clean_titanic(tidf):
    
    to_drop = ['class', 'embarked', 'deck', 'passenger_id', 'age']
    
    tidf.drop(columns = to_drop, inplace = True)
    
    tidf['embark_town'].fillna('Southampton', inplace = True)
    
    dummies = pd.get_dummies(tidf[['sex', 'embark_town']], drop_first = True)
    
    tidf = pd.concat([tidf, dummies], axis = 1)

    return tidf

In [55]:
test_titanic_df = acquire.get_titanic_data(env.sql_connexion)

test_titanic_df.head()

,Unnamed: 0,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1

In [56]:
tidied_titanic = prep_titanic(test_titanic_df)

tidied_titanic

KeyError: "['passenger_id', 'embarked', 'deck', 'age'] not found in axis"